zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/gmac.h
/* -------- GMAC_IDR : (GMAC Offset: 0x2c) (/W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MFS:1;                     /**< bit:      0  Management Frame Sent                    */
    uint32_t RCOMP:1;                   /**< bit:      1  Receive Complete                         */
    uint32_t RXUBR:1;                   /**< bit:      2  RX Used Bit Read                         */
    uint32_t TXUBR:1;                   /**< bit:      3  TX Used Bit Read                         */
    uint32_t TUR:1;                     /**< bit:      4  Transmit Underrun                        */
    uint32_t RLEX:1;                    /**< bit:      5  Retry Limit Exceeded or Late Collision   */
    uint32_t TFC:1;                     /**< bit:      6  Transmit Frame Corruption Due to AHB Error */
    uint32_t TCOMP:1;                   /**< bit:      7  Transmit Complete                        */
    uint32_t :2;                        /**< bit:   8..9  Reserved */
    uint32_t ROVR:1;                    /**< bit:     10  Receive Overrun                          */
    uint32_t HRESP:1;                   /**< bit:     11  HRESP Not OK                             */
    uint32_t PFNZ:1;                    /**< bit:     12  Pause Frame with Non-zero Pause Quantum Received */
    uint32_t PTZ:1;                     /**< bit:     13  Pause Time Zero                          */
    uint32_t PFTR:1;                    /**< bit:     14  Pause Frame Transmitted                  */
    uint32_t EXINT:1;                   /**< bit:     15  External Interrupt                       */
    uint32_t :2;                        /**< bit: 16..17  Reserved */
    uint32_t DRQFR:1;                   /**< bit:     18  PTP Delay Request Frame Received         */
    uint32_t SFR:1;                     /**< bit:     19  PTP Sync Frame Received                  */
    uint32_t DRQFT:1;                   /**< bit:     20  PTP Delay Request Frame Transmitted      */
    uint32_t SFT:1;                     /**< bit:     21  PTP Sync Frame Transmitted               */
    uint32_t PDRQFR:1;                  /**< bit:     22  PDelay Request Frame Received            */
    uint32_t PDRSFR:1;                  /**< bit:     23  PDelay Response Frame Received           */
    uint32_t PDRQFT:1;                  /**< bit:     24  PDelay Request Frame Transmitted         */
    uint32_t PDRSFT:1;                  /**< bit:     25  PDelay Response Frame Transmitted        */
    uint32_t SRI:1;                     /**< bit:     26  TSU Seconds Register Increment           */
    uint32_t :1;                        /**< bit:     27  Reserved */
    uint32_t WOL:1;                     /**< bit:     28  Wake On LAN                              */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_IDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GMAC_IDR_OFFSET                     (0x2C)                                        /**<  (GMAC_IDR) Interrupt Disable Register  Offset */

#define GMAC_IDR_MFS_Pos                    0                                              /**< (GMAC_IDR) Management Frame Sent Position */
#define GMAC_IDR_MFS_Msk                    (_U_(0x1) << GMAC_IDR_MFS_Pos)                 /**< (GMAC_IDR) Management Frame Sent Mask */
#define GMAC_IDR_MFS                        GMAC_IDR_MFS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_MFS_Msk instead */
#define GMAC_IDR_RCOMP_Pos                  1                                              /**< (GMAC_IDR) Receive Complete Position */
#define GMAC_IDR_RCOMP_Msk                  (_U_(0x1) << GMAC_IDR_RCOMP_Pos)               /**< (GMAC_IDR) Receive Complete Mask */
#define GMAC_IDR_RCOMP                      GMAC_IDR_RCOMP_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_RCOMP_Msk instead */
#define GMAC_IDR_RXUBR_Pos                  2                                              /**< (GMAC_IDR) RX Used Bit Read Position */
#define GMAC_IDR_RXUBR_Msk                  (_U_(0x1) << GMAC_IDR_RXUBR_Pos)               /**< (GMAC_IDR) RX Used Bit Read Mask */
#define GMAC_IDR_RXUBR                      GMAC_IDR_RXUBR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_RXUBR_Msk instead */
#define GMAC_IDR_TXUBR_Pos                  3                                              /**< (GMAC_IDR) TX Used Bit Read Position */
#define GMAC_IDR_TXUBR_Msk                  (_U_(0x1) << GMAC_IDR_TXUBR_Pos)               /**< (GMAC_IDR) TX Used Bit Read Mask */
#define GMAC_IDR_TXUBR                      GMAC_IDR_TXUBR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_TXUBR_Msk instead */
#define GMAC_IDR_TUR_Pos                    4                                              /**< (GMAC_IDR) Transmit Underrun Position */
#define GMAC_IDR_TUR_Msk                    (_U_(0x1) << GMAC_IDR_TUR_Pos)                 /**< (GMAC_IDR) Transmit Underrun Mask */
#define GMAC_IDR_TUR                        GMAC_IDR_TUR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_TUR_Msk instead */
#define GMAC_IDR_RLEX_Pos                   5                                              /**< (GMAC_IDR) Retry Limit Exceeded or Late Collision Position */
#define GMAC_IDR_RLEX_Msk                   (_U_(0x1) << GMAC_IDR_RLEX_Pos)                /**< (GMAC_IDR) Retry Limit Exceeded or Late Collision Mask */
#define GMAC_IDR_RLEX                       GMAC_IDR_RLEX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_RLEX_Msk instead */
#define GMAC_IDR_TFC_Pos                    6                                              /**< (GMAC_IDR) Transmit Frame Corruption Due to AHB Error Position */
#define GMAC_IDR_TFC_Msk                    (_U_(0x1) << GMAC_IDR_TFC_Pos)                 /**< (GMAC_IDR) Transmit Frame Corruption Due to AHB Error Mask */
#define GMAC_IDR_TFC                        GMAC_IDR_TFC_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_TFC_Msk instead */
#define GMAC_IDR_TCOMP_Pos                  7                                              /**< (GMAC_IDR) Transmit Complete Position */
#define GMAC_IDR_TCOMP_Msk                  (_U_(0x1) << GMAC_IDR_TCOMP_Pos)               /**< (GMAC_IDR) Transmit Complete Mask */
#define GMAC_IDR_TCOMP                      GMAC_IDR_TCOMP_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_TCOMP_Msk instead */
#define GMAC_IDR_ROVR_Pos                   10                                             /**< (GMAC_IDR) Receive Overrun Position */
#define GMAC_IDR_ROVR_Msk                   (_U_(0x1) << GMAC_IDR_ROVR_Pos)                /**< (GMAC_IDR) Receive Overrun Mask */
#define GMAC_IDR_ROVR                       GMAC_IDR_ROVR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_ROVR_Msk instead */
#define GMAC_IDR_HRESP_Pos                  11                                             /**< (GMAC_IDR) HRESP Not OK Position */
#define GMAC_IDR_HRESP_Msk                  (_U_(0x1) << GMAC_IDR_HRESP_Pos)               /**< (GMAC_IDR) HRESP Not OK Mask */
#define GMAC_IDR_HRESP                      GMAC_IDR_HRESP_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_HRESP_Msk instead */
#define GMAC_IDR_PFNZ_Pos                   12                                             /**< (GMAC_IDR) Pause Frame with Non-zero Pause Quantum Received Position */
#define GMAC_IDR_PFNZ_Msk                   (_U_(0x1) << GMAC_IDR_PFNZ_Pos)                /**< (GMAC_IDR) Pause Frame with Non-zero Pause Quantum Received Mask */
#define GMAC_IDR_PFNZ                       GMAC_IDR_PFNZ_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_PFNZ_Msk instead */
#define GMAC_IDR_PTZ_Pos                    13                                             /**< (GMAC_IDR) Pause Time Zero Position */
#define GMAC_IDR_PTZ_Msk                    (_U_(0x1) << GMAC_IDR_PTZ_Pos)                 /**< (GMAC_IDR) Pause Time Zero Mask */
#define GMAC_IDR_PTZ                        GMAC_IDR_PTZ_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_PTZ_Msk instead */
#define GMAC_IDR_PFTR_Pos                   14                                             /**< (GMAC_IDR) Pause Frame Transmitted Position */
#define GMAC_IDR_PFTR_Msk                   (_U_(0x1) << GMAC_IDR_PFTR_Pos)                /**< (GMAC_IDR) Pause Frame Transmitted Mask */
#define GMAC_IDR_PFTR                       GMAC_IDR_PFTR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_PFTR_Msk instead */
#define GMAC_IDR_EXINT_Pos                  15                                             /**< (GMAC_IDR) External Interrupt Position */
#define GMAC_IDR_EXINT_Msk                  (_U_(0x1) << GMAC_IDR_EXINT_Pos)               /**< (GMAC_IDR) External Interrupt Mask */
#define GMAC_IDR_EXINT                      GMAC_IDR_EXINT_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_EXINT_Msk instead */
#define GMAC_IDR_DRQFR_Pos                  18                                             /**< (GMAC_IDR) PTP Delay Request Frame Received Position */
#define GMAC_IDR_DRQFR_Msk                  (_U_(0x1) << GMAC_IDR_DRQFR_Pos)               /**< (GMAC_IDR) PTP Delay Request Frame Received Mask */
#define GMAC_IDR_DRQFR                      GMAC_IDR_DRQFR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_DRQFR_Msk instead */
#define GMAC_IDR_SFR_Pos                    19                                             /**< (GMAC_IDR) PTP Sync Frame Received Position */
#define GMAC_IDR_SFR_Msk                    (_U_(0x1) << GMAC_IDR_SFR_Pos)                 /**< (GMAC_IDR) PTP Sync Frame Received Mask */
#define GMAC_IDR_SFR                        GMAC_IDR_SFR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_SFR_Msk instead */
#define GMAC_IDR_DRQFT_Pos                  20                                             /**< (GMAC_IDR) PTP Delay Request Frame Transmitted Position */
#define GMAC_IDR_DRQFT_Msk                  (_U_(0x1) << GMAC_IDR_DRQFT_Pos)               /**< (GMAC_IDR) PTP Delay Request Frame Transmitted Mask */
#define GMAC_IDR_DRQFT                      GMAC_IDR_DRQFT_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_DRQFT_Msk instead */
#define GMAC_IDR_SFT_Pos                    21                                             /**< (GMAC_IDR) PTP Sync Frame Transmitted Position */
#define GMAC_IDR_SFT_Msk                    (_U_(0x1) << GMAC_IDR_SFT_Pos)                 /**< (GMAC_IDR) PTP Sync Frame Transmitted Mask */
#define GMAC_IDR_SFT                        GMAC_IDR_SFT_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_SFT_Msk instead */
#define GMAC_IDR_PDRQFR_Pos                 22                                             /**< (GMAC_IDR) PDelay Request Frame Received Position */
#define GMAC_IDR_PDRQFR_Msk                 (_U_(0x1) << GMAC_IDR_PDRQFR_Pos)              /**< (GMAC_IDR) PDelay Request Frame Received Mask */
#define GMAC_IDR_PDRQFR                     GMAC_IDR_PDRQFR_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_PDRQFR_Msk instead */
#define GMAC_IDR_PDRSFR_Pos                 23                                             /**< (GMAC_IDR) PDelay Response Frame Received Position */
#define GMAC_IDR_PDRSFR_Msk                 (_U_(0x1) << GMAC_IDR_PDRSFR_Pos)              /**< (GMAC_IDR) PDelay Response Frame Received Mask */
#define GMAC_IDR_PDRSFR                     GMAC_IDR_PDRSFR_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_PDRSFR_Msk instead */
#define GMAC_IDR_PDRQFT_Pos                 24                                             /**< (GMAC_IDR) PDelay Request Frame Transmitted Position */
#define GMAC_IDR_PDRQFT_Msk                 (_U_(0x1) << GMAC_IDR_PDRQFT_Pos)              /**< (GMAC_IDR) PDelay Request Frame Transmitted Mask */
#define GMAC_IDR_PDRQFT                     GMAC_IDR_PDRQFT_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_PDRQFT_Msk instead */
#define GMAC_IDR_PDRSFT_Pos                 25                                             /**< (GMAC_IDR) PDelay Response Frame Transmitted Position */
#define GMAC_IDR_PDRSFT_Msk                 (_U_(0x1) << GMAC_IDR_PDRSFT_Pos)              /**< (GMAC_IDR) PDelay Response Frame Transmitted Mask */
#define GMAC_IDR_PDRSFT                     GMAC_IDR_PDRSFT_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_PDRSFT_Msk instead */
#define GMAC_IDR_SRI_Pos                    26                                             /**< (GMAC_IDR) TSU Seconds Register Increment Position */
#define GMAC_IDR_SRI_Msk                    (_U_(0x1) << GMAC_IDR_SRI_Pos)                 /**< (GMAC_IDR) TSU Seconds Register Increment Mask */
#define GMAC_IDR_SRI                        GMAC_IDR_SRI_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_SRI_Msk instead */
#define GMAC_IDR_WOL_Pos                    28                                             /**< (GMAC_IDR) Wake On LAN Position */
#define GMAC_IDR_WOL_Msk                    (_U_(0x1) << GMAC_IDR_WOL_Pos)                 /**< (GMAC_IDR) Wake On LAN Mask */
#define GMAC_IDR_WOL                        GMAC_IDR_WOL_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use GMAC_IDR_WOL_Msk instead */
#define GMAC_IDR_MASK                       _U_(0x17FCFCFF)                                /**< \deprecated (GMAC_IDR) Register MASK  (Use GMAC_IDR_Msk instead)  */
#define GMAC_IDR_Msk                        _U_(0x17FCFCFF)                                /**< (GMAC_IDR) Register Mask  */


/* -------- GMAC_IMR : (GMAC Offset: 0x30) (R/W 32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MFS:1;                     /**< bit:      0  Management Frame Sent                    */
    uint32_t RCOMP:1;                   /**< bit:      1  Receive Complete                         */
    uint32_t RXUBR:1;                   /**< bit:      2  RX Used Bit Read                         */
    uint32_t TXUBR:1;                   /**< bit:      3  TX Used Bit Read                         */
    uint32_t TUR:1;                     /**< bit:      4  Transmit Underrun                        */
    uint32_t RLEX:1;                    /**< bit:      5  Retry Limit Exceeded                     */
    uint32_t TFC:1;                     /**< bit:      6  Transmit Frame Corruption Due to AHB Error */
    uint32_t TCOMP:1;                   /**< bit:      7  Transmit Complete                        */
    uint32_t :2;                        /**< bit:   8..9  Reserved */
    uint32_t ROVR:1;                    /**< bit:     10  Receive Overrun                          */
    uint32_t HRESP:1;                   /**< bit:     11  HRESP Not OK                             */
    uint32_t PFNZ:1;                    /**< bit:     12  Pause Frame with Non-zero Pause Quantum Received */
    uint32_t PTZ:1;                     /**< bit:     13  Pause Time Zero                          */
    uint32_t PFTR:1;                    /**< bit:     14  Pause Frame Transmitted                  */
    uint32_t EXINT:1;                   /**< bit:     15  External Interrupt                       */
    uint32_t :2;                        /**< bit: 16..17  Reserved */
    uint32_t DRQFR:1;                   /**< bit:     18  PTP Delay Request Frame Received         */
    uint32_t SFR:1;                     /**< bit:     19  PTP Sync Frame Received                  */
    uint32_t DRQFT:1;                   /**< bit:     20  PTP Delay Request Frame Transmitted      */
    uint32_t SFT:1;                     /**< bit:     21  PTP Sync Frame Transmitted               */
    uint32_t PDRQFR:1;                  /**< bit:     22  PDelay Request Frame Received            */
    uint32_t PDRSFR:1;                  /**< bit:     23  PDelay Response Frame Received           */
    uint32_t PDRQFT:1;                  /**< bit:     24  PDelay Request Frame Transmitted         */
    uint32_t PDRSFT:1;                  /**< bit:     25  PDelay Response Frame Transmitted        */
    uint32_t SRI:1;                     /**< bit:     26  TSU Seconds Register Increment           */
    uint32_t :1;                        /**< bit:     27  Reserved */
    uint32_t WOL:1;                     /**< bit:     28  Wake On LAN                              */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} GMAC_IMR_Type;
